ezois_ka/oooezoiskaobmen/src/Documents/ОбращениеСФРКСтрахователю/ОбращениеСФРКСтрахователю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбращениеСФРКСтрахователю</name>
  <comment>Сообщение СЭДО 1001 &quot;Обращение СФР к страхователю&quot;</comment>
  <posting>Deny</posting>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <comment>Заголовок обращения к страхователю</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <comment>Идентификатор сообщения СЭДО 1001</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменЧерезОператора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветДоставленВСФР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкиПриЗагрузке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОтправки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОбращения</name>
    <comment>Тело обращения к страхователю, Строка 2000</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибкиОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ФайлыОбращения</name>
    <comment>Файлы обращения к страхователю</comment>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержимое</name>
      <comment>Содержимое обращения</comment>
      <type>
        <types>CatalogRef.ОбращениеСФРКСтрахователюПрисоединенныеФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Enums/ТипыКонтролирующихОрганов/ТипыКонтролирующихОрганов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтролирующихОрганов</name>
  <enumValues>
    <name>ФНС</name>
  </enumValues>
  <enumValues>
    <name>ПФР</name>
  </enumValues>
  <enumValues>
    <name>ФСС</name>
  </enumValues>
  <enumValues>
    <name>ФСГС</name>
  </enumValues>
  <enumValues>
    <name>ФСРАР</name>
  </enumValues>
  <enumValues>
    <name>РПН</name>
  </enumValues>
  <enumValues>
    <name>УдалитьБанкРоссии</name>
  </enumValues>
  <enumValues>
    <name>ФТС</name>
  </enumValues>
  <enumValues>
    <name>Роструд</name>
  </enumValues>
  <enumValues>
    <name>Минобороны</name>
  </enumValues>
  <enumValues>
    <name>ФАС</name>
  </enumValues>
  <enumValues>
    <name>Минюст</name>
  </enumValues>
  <enumValues>
    <name>РЭЦ</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияЮЛФНС</name>
  </enumValues>
  <enumValues>
    <name>ЦБ</name>
  </enumValues>
  <enumValues>
    <name>ЦПРР</name>
  </enumValues>
  <enumValues>
    <name>Роскомнадзор</name>
  </enumValues>
  <enumValues>
    <name>МВД</name>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen/src/Documents/ОтветСтрахователяНаОбращениеСФР/ОтветСтрахователяНаОбращениеСФР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтветСтрахователяНаОбращениеСФР</name>
  <basedOn>Document.ОбращениеСФРКСтрахователю</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияРезультата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормированияРезультатаПриема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставленоВСФР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <comment>Заголовок ответа на обращение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОтвета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРезультата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Квитанция</name>
    <comment>Квитанция успеха</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменЧерезОператора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ОбращениеСФРКСтрахователю</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Протокол</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОтправки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОтвета</name>
    <comment>Тело ответа на обращение, Строка 2000</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибкиОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Вложения</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержимое</name>
      <type>
        <types>CatalogRef.ОтветСтрахователяНаОбращениеСФРПрисоединенныеФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Catalogs/ОтправкиФСС/ОтправкиФСС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОтправкиФСС</name>
  <attributes>
    <name>ОтчетСсылка</name>
    <type>
      <types>DefinedType.ПредметОтправкиОтчетаФСС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОтправкиНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗашифрованныйПакет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаПакета</name>
    <comment>Имя файла зашифрованного пакета выгрузки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОтправки</name>
    <type>
      <types>EnumRef.СтатусыОтправки</types>
    </type>
  </attributes>
  <attributes>
    <name>Протокол</name>
    <comment>Протокол обработки</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияРезультата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Квитанция</name>
    <comment>Квитанция успеха</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтправляемыхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <comment>Для представления в упр.формах документооборота с КО</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВидаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанныйПакет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПакетКвитанции</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменЧерезОператора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставленоВСФР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставкиВСФР</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КвитанцияДоставкиВСФР</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

ezois_ka/oooezoiskaobmen/src/Documents/ОбращениеСФРКСтрахователю/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем КонтекстЭДОКлиент;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = НСтр("ru='Обращение СФР:'") + " " + Объект.Заголовок;
	
	СписокИменФайлов = Новый Массив;
	ИндексФайла = 0;
	Для каждого Вложение Из Объект.ФайлыОбращения Цикл
		ПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Вложение.Содержимое, "ПометкаУдаления");
		Если ЗначениеЗаполнено(Вложение.Содержимое)
			И НЕ ПометкаУдаления Тогда
			ДанныеФайла = Новый Структура("ИмяФайла,Размер,Ссылка",
				Вложение.ИмяФайла, Вложение.Размер, Строка(ИндексФайла));
			СписокИменФайлов.Добавить(ДанныеФайла);
			ИндексФайла = ИндексФайла + 1;
		КонецЕсли;
	КонецЦикла;
	Элементы.Вложения.Заголовок = ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ФорматированноеПредставлениеСпискаВложений(
		СписокИменФайлов);
	ОтправительТекстом = НСтр("ru='СФР'");
	ПолучательТекстом = Объект.Организация;
	
	ЕстьВложения = Объект.ФайлыОбращения.Количество() > 0;
	Элементы.Вложения.Видимость = ЕстьВложения;
	Элементы.ЗаголовокВложения.Видимость = ЕстьВложения;
	Элементы.КомандаСохранитьВложения.Видимость = ЕстьВложения;
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганами.ОтметитьКакПрочтенное(Объект.Ссылка);
	
	УправлениеЭлементамиФормы();
	
	ИнициализироватьВыводСтатусовИВажныхСообщений_85();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		ТестСообщения = НСтр("ru='Создание обращений к СФР не предусмотрено, они загружаются из сервиса СЭДО.'");
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(, ТестСообщения, 60);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИндексФайла = Число(НавигационнаяСсылкаФорматированнойСтроки);
	ОбработатьВложениеНавигационнойСсылки(ИндексФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаОтветыНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПоказатьОтветыПослеПолученияКонтекста", 
		ЭтотОбъект);
		
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ДатыЗапретаИзменения") Тогда
		ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ИмяСобытияПолучения = ЭлектронныйДокументооборотСФССКлиент.ИмяСобытияОповещенияЗавершенияПолученияСообщенийИзСЭДО();
	ИмяСобытияОтправки = ЭлектронныйДокументооборотСФССКлиент.ИмяСобытияОповещенияЗавершенияОтправкиСообщенийВСЭДО();
	
	Если ИмяСобытия = ИмяСобытияПолучения
		ИЛИ ИмяСобытия = ИмяСобытияОтправки Тогда
		
		УправлениеЭлементамиФормы();
		
	КонецЕсли;
	
	Если РегламентированнаяОтчетностьКлиент.ЭтоСобытиеЗавершениеОтправки(ИмяСобытия) Тогда
		ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере();	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура Ответить(Команда)
	
	Ответы = ОтветыНаОбращение(Объект.Ссылка);
	
	// ищем существующий ответ
	Если Ответы.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'На данное обращение уже создан ответ. Вы уверены, что хотите создать новый?'");
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СформированныйОтвет = СфомироватьОтветНаСервере(Объект.Ссылка);
	
	Если СформированныйОтвет =
			ПредопределенноеЗначение("Документ.ОтветСтрахователяНаОбращениеСФР.ПустаяСсылка") Тогда
			
			Возврат;
	КонецЕсли;
		
	ПараметрыФормы = Новый Структура("Ключ", СформированныйОтвет);
	ОткрытьФорму(
		"Документ.ОтветСтрахователяНаОбращениеСФР.Форма.ФормаДокумента",
		ПараметрыФормы);
		
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложения(Команда)
	
	Вложения = Новый Массив;
	Для каждого Вложение Из Объект.ФайлыОбращения Цикл
		Вложения.Добавить(Вложение.ИмяФайла);
	КонецЦикла;
	
	ОписанияФайлов = Новый Массив;
	
	Для Каждого Вложение Из Объект.ФайлыОбращения Цикл
		ДанныеФайла = ДанныеФайла(Вложение.Содержимое, ЭтотОбъект.УникальныйИдентификатор);
		АдресДанных = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
		Если ЗначениеЗаполнено(АдресДанных) Тогда 
			ОписаниеФайла = Новый ОписаниеПередаваемогоФайла(
				ОбщегоНазначенияЭДКОКлиентСервер.ЗаменитьЗапрещенныеСимволыВИмениФайла(Вложение.ИмяФайла),
				АдресДанных); 
			ОписанияФайлов.Добавить(ОписаниеФайла);
		КонецЕсли;
	КонецЦикла;
	
	Если ОписанияФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ОперацииСФайламиЭДКОКлиент.СохранитьФайлы(ОписанияФайлов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Ответы = ОтветыНаОбращение(Объект.Ссылка);
	ОтветыКоличество = Ответы.Количество();
	ЗаголовокОтветы = "Ответы (" + ОтветыКоличество + ")";
	Элементы.ГиперссылкаОтветы.Заголовок = ЗаголовокОтветы;
	Элементы.ГиперссылкаОтветы.Видимость = ОтветыКоличество > 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ОтправкиФСС.Ссылка КАК Ссылка,
	               |	ОтправкиФСС.СтатусОтправки КАК СтатусОтправки
	               |ИЗ
	               |	Справочник.ОтправкиФСС КАК ОтправкиФСС
	               |ГДЕ
	               |	ОтправкиФСС.ОтчетСсылка = &Обращение
	               |	И ОтправкиФСС.ПометкаУдаления = ЛОЖЬ
	               |	И ОтправкиФСС.Организация = &Организация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОтправкиФСС.ДатаОтправки УБЫВ";

	Запрос.УстановитьПараметр("Обращение", Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	ОтправкиОбращения = Запрос.Выполнить().Выгрузить();
	Если ОтправкиОбращения.Количество() = 0 Тогда
		Статус = Объект.Статус;
	Иначе
		Статус = ОтправкиОбращения[0].СтатусОтправки;
	КонецЕсли;
	
	ПараметрыПрорисовкиПанелиОтправки = ДокументооборотСКОВызовСервера.ПараметрыПрорисовкиПанелиОтправки(
		Объект.Ссылка, Объект.Организация, Перечисления.ТипыКонтролирующихОрганов.ФСС);
	НаименованиеЭтапа = ПараметрыПрорисовкиПанелиОтправки.ТекущийЭтапОтправки.ТекстСтатуса;
	Элементы.СостояниеОтправки.Видимость = НЕ ПустаяСтрока(НаименованиеЭтапа);
	Если Статус = Перечисления.СтатусыОтправки.НеПринят Тогда
		Элементы.БлокСостоянияОтправки.ЦветФона = ЦветаСтиля.ЦветФонаОшибкиОтправки;
	ИначеЕсли Статус = Перечисления.СтатусыОтправки.Сдан Тогда
		Элементы.БлокСостоянияОтправки.ЦветФона = ЦветаСтиля.ЦветФонаУдачнойОтправки;
	ИначеЕсли Статус = Перечисления.СтатусыОтправки.Отправлен Тогда
		Элементы.БлокСостоянияОтправки.ЦветФона = ЦветаСтиля.ЦветФонаТекущейОтправки;
	Иначе
		Элементы.БлокСостоянияОтправки.ЦветФона = ЦветаСтиля.БазовыйЦветФонаЭтапаОтправки;
	КонецЕсли;
	Элементы.НаименованиеЭтапа.Заголовок = НаименованиеЭтапа;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтветыНаОбращение(Ссылка)
	
	Возврат ЭлектронныйДокументооборотСФСС.ОтветыНаОбращениеСФРКСтрахователю(Ссылка);
	
КонецФункции

&НаСервере
Функция СфомироватьОтветНаСервере(Ссылка)
	
	Результат = ЭлектронныйДокументооборотСФСС.СфомироватьОтветНаОбращениеСФРКСтрахователю(Ссылка);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеФайла(СсылкаНаФайл, Идентификатор)
	
	ПараметрыФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	ПараметрыФайла.ИдентификаторФормы = Идентификатор;
	Возврат РаботаСФайлами.ДанныеФайла(СсылкаНаФайл, ПараметрыФайла);
	
КонецФункции

&НаКлиенте
Процедура ПоказатьОтветыПослеПолученияКонтекста(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.КонтекстЭДО = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	КонтекстЭДОКлиент.ПоказатьОтветыНаОбращениеСФРКСтрахователю(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВложениеНавигационнойСсылки(ИндексФайла)
	
	Файл = Объект.ФайлыОбращения[ИндексФайла];
	ДанныеФайла = ДанныеФайла(Файл.Содержимое, ЭтотОбъект.УникальныйИдентификатор);
	РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьВыводСтатусовИВажныхСообщений_85()

	Если РегламентированнаяОтчетность.ДоступнаПодсистема85() Тогда
		МодульЭДОСКонтролирующимиОрганами = ОбщегоНазначения.ОбщийМодуль("ЭлектронныйДокументооборотСКонтролирующимиОрганами");
		МодульЭДОСКонтролирующимиОрганами.УстановитьРазмещениеНаименованияЭтапаБРО_85(ЭтотОбъект);
		МодульЭДОСКонтролирующимиОрганами.ВывестиСтатусыИВыжныеСообщенияНаФорму_85(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере() Экспорт

	Если РегламентированнаяОтчетность.ДоступнаПодсистема85() Тогда
		МодульЭДОСКонтролирующимиОрганами = ОбщегоНазначения.ОбщийМодуль("ЭлектронныйДокументооборотСКонтролирующимиОрганами");
		МодульЭДОСКонтролирующимиОрганами.ВывестиСтатусыИВыжныеСообщенияНаФорму_85(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДетальноеОписаниеСтатусаПослеВыбора(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если Результат = "ОбновитьОтправку" Тогда
		
		Ответить(Неопределено);
				
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиСтатусыИВыжныеСообщенияНаФорму() Экспорт

	ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаНажатияКнопкиВВажномСообщении(Команда)

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаНавигационнойСсылкиВВажномСообщении(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаЗакрытияВажногоСообщения(Команда)

	МодульКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер");
	МодульКлиентСервер.ЗакрытьВажноеСообщение(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)

	МодульОбщегоНазначенияКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбщегоНазначенияКлиент");
	МодульОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда, НавигационнаяСсылка, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти
